app/Controllers/Admin/Admin.php

    public function dashboard()
    {
        $absensi = new Absensi();
        $user = new MemberModel();
        $bulanIni = date('Y-m');

        $absensiInfo = $absensi->where("DATE_FORMAT(waktu_absen,'%Y-%m')", $bulanIni)->select('nim_nis, jenis_user')->distinct('nim_nis')->get()->getResult();
        $totalAbsensi = [];
        foreach ($absensiInfo as $nim_nis) {
            $nimUser = $nim_nis->nim_nis;
            $totalAbsensi[$nimUser]['masuk'] = $absensi->getTotalAbsensiByStatus($nimUser, 'Masuk');
            $totalAbsensi[$nimUser]['izin'] = $absensi->getTotalAbsensiByStatus($nimUser, 'Izin');
            $totalAbsensi[$nimUser]['sakit'] = $absensi->getTotalAbsensiByStatus($nimUser, 'Sakit');
        }

        $jumlahSekolah = $user->getJumlahInstansi('School');
        $jumlahUniv = $user->getJumlahInstansi('College School');
        $totalSiswa = $user->getUser('Student');
        $totalMahasiswa = $user->getUser('College Student');
        $totalUser = $user->where('is_verifikasi', 'yes')->countAllResults();
---
SELECT DISTINCT `nim_nis`, `jenis_user`
FROM `absensi`
WHERE DATE_FORMAT(waktu_absen,'%Y-%m') = '2024-09'
SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `is_verifikasi` = 'yes'

    public function data_absen()
    {
        $absensi = new Absensi();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_absensi');
        $dataAbsen = $absensi->orderBy('waktu_absen', 'desc')->orderBy('id', 'desc')->findAll();
        $nama_lengkap = [];
        foreach ($dataAbsen as $v) {
            $nimUser = $v['nim_nis'];
            $data = $user->where('nim_nis', $nimUser)->get()->getRowArray();
            $nama_lengkap[$nimUser] = $data ? $data['nama_lengkap'] : $v['nama_lengkap'];
        }
        $dataUser = $user->orderBy('nama_lengkap', 'asc')->where('is_verifikasi', 'yes')->findAll();
---
SELECT *
FROM `absensi`
ORDER BY `waktu_absen` DESC, `id` DESC
SELECT *
FROM `member`
WHERE `nim_nis` = '2214312221'
SELECT *
FROM `member`
WHERE `is_verifikasi` = 'yes'
ORDER BY `nama_lengkap` ASC

    public function data_siswa()
    {
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_siswa');
        $dataSiswa = $user->where('jenis_user', 'Student')->findAll();
---
SELECT *
FROM `member`
WHERE `jenis_user` = 'Student'

    public function instansi_sekolah()
    {
        $user = new MemberModel();
        $instansi = new Instansi();
        $dataInstansi = $user->select('nama_instansi, instansi_pendidikan')->where('instansi_pendidikan', 'School')->distinct('nama_instansi')->get()->getResult();

        foreach ($dataInstansi as $v) {
            $jumlahSiswa[$v->nama_instansi] = $user->where('nama_instansi', $v->nama_instansi)->countAllResults();
            $instansiResult = $instansi->select('nama_instansi, foto_instansi')->where('nama_instansi', $v->nama_instansi)->get()->getRow();
---
SELECT DISTINCT `nama_instansi`, `instansi_pendidikan`
FROM `member`
WHERE `instansi_pendidikan` = 'School'
SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `nama_instansi` = 'SMKN 1 KOTA BEKASI'
SELECT `nama_instansi`, `foto_instansi`
FROM `instansi`
WHERE `nama_instansi` = 'SMKN 1 KOTA BEKASI'

    public function rekap_siswa()
    {
        $absensi = new Absensi();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_absensi');
        //$dataAbsen = $absensi->select('nama_lengkap, nim_nis, nama_instansi, status, waktu_absen')->orderBy('id', 'desc')->where('jenis_user', 'Student')->distinct('nim_nis')->get()->getResult();
        $dataUser = $user->where('jenis_user', 'Student')->orderBy('nama_lengkap', 'asc')->findAll();
        $dataAbsens = $absensi->orderBy('waktu_absen', 'desc')->orderBy('id', 'desc')->where('jenis_user', 'Siswa')->findAll();
        $absensiInfo = $absensi->where("DATE_FORMAT(waktu_absen,'%Y-%m')", date('Y-m'))->select('nim_nis, jenis_user')->distinct('nim_nis')->get()->getResult();
        $totalAbsensi = [];
        foreach ($absensiInfo as $nim_nis) {
            $nimUser = $nim_nis->nim_nis;
            $status = $absensi->orderBy('waktu_absen', 'desc')->orderBy('id', 'desc')->where('jenis_user', 'Siswa')->findAll();
---
SELECT *
FROM `member`
WHERE `jenis_user` = 'Student'
ORDER BY `nama_lengkap` ASC
SELECT *
FROM `absensi`
WHERE `jenis_user` = 'Siswa'
ORDER BY `waktu_absen` DESC, `id` DESC
SELECT DISTINCT `nim_nis`, `jenis_user`
FROM `absensi`
WHERE DATE_FORMAT(waktu_absen,'%Y-%m') = '2024-09'
SELECT *
FROM `absensi`
WHERE `nim_nis` = '141141'
AND DATE_FORMAT(waktu_absen, "%Y-%m") = '2024-09'
AND `jenis_user` = 'Siswa'
ORDER BY `waktu_absen` DESC, `id` DESC

    public function rekap_aktifitasSiswa()
    {
        $laporan = new Laporan();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_laporan');
        $dataLaporan = $laporan->orderBy('waktu_laporan', 'desc')->orderBy('id_laporan', 'desc')->where('jenis_user', 'Student')->findAll();
        $dataUser = $user->where('jenis_user', 'Student')->orderBy('nama_lengkap', 'asc')->findAll();
---
SELECT *
FROM `laporan`
WHERE `jenis_user` = 'Student'
ORDER BY `waktu_laporan` DESC, `id_laporan` DESC
SELECT *
FROM `member`
WHERE `jenis_user` = 'Student'
ORDER BY `nama_lengkap` ASC

    public function rekap_aktifitasMahasiswa()
    {
        $laporan = new Laporan();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_absensi');
        $dataLaporan = $laporan->orderBy('waktu_laporan', 'desc')->orderBy('id_laporan', 'desc')->where('jenis_user', 'College Student')->findAll();
        $dataUser = $user->where('jenis_user', 'College Student')->orderBy('nama_lengkap', 'asc')->findAll();
---
SELECT *
FROM `laporan`
WHERE `jenis_user` = 'College Student'
ORDER BY `waktu_laporan` DESC, `id_laporan` DESC
SELECT *
FROM `member`
WHERE `jenis_user` = 'College Student'
ORDER BY `nama_lengkap` ASC