app/Controllers/Admin/Admin.php

SELECT *
FROM `member`
WHERE `jenis_user` = 'College Student'
ORDER BY `nama_lengkap` ASC
---
    public function rekap_mahasiswa()
    {
        $absensi = new Absensi();
        $user = new MemberModel();
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_absensi');
        //$dataAbsen = $absensi->select('nama_lengkap, nim_nis, nama_instansi, status, waktu_absen')->orderBy('id', 'desc')->where('jenis_user', 'Student')->distinct('nim_nis')->get()->getResult();
        $dataUser = $user->where('jenis_user', 'Collage Student')->orderBy('nama_lengkap', 'asc')->findAll();