app/Controllers/Admin/Modal.php

SELECT *
FROM `member`
WHERE `member`.`member_id` = '55'
---
    public function editUser($id)
    {
        $user = new MemberModel();
        $data = $user->find($id);

SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `nama_instansi` = 'SMKN 1 KOTA BEKASI'
SELECT *
FROM `member`
WHERE `nama_instansi` = 'SMKN 1 KOTA BEKASI'
 LIMIT 1
---
    public function instansi($nama)
    {
        $user = new MemberModel();
        $jumlahSiswa = $user->where('nama_instansi', $nama)->countAllResults();
        $dataUser = $user->where('nama_instansi', $nama)->first();