app/Controllers/Admin/SuperAdmin.php

    public function super_admin()
    {
        $user = new MemberModel();
        $sesi_id = session()->get("member_id");
        $dataUser = $user->where('is_verifikasi', 'yes')->findAll();
---
SELECT *
FROM `member`
WHERE `is_verifikasi` = 'yes'