app/Controllers/User/Auth.php

SELECT *
FROM `member`
WHERE `username` = 'daffa.reivan'
OR `email` = 'daffa.reivan'
 LIMIT 1
---
    public function login()
    {
        if (get_cookie('cookie_username') && get_cookie('cookie_password')) {
            $username = get_cookie('cookie_username');
            $password = get_cookie('cookie_password');
            $user = new MemberModel();

            $dataAkun = $user->where('username', $username)->orWhere('email', $username)->first();