app/Controllers/User/User.php

SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `nim_nis` = '17200106'
---
    public function historyActivity()
    {
        $activity = new Laporan();
        $user = new MemberModel();
        $sesi_nim = session()->get('member_nim_nis');
        $jumlahBaris = 10;
        $currentPage = $this->request->getVar('page_activity');
        $dataActivity = $activity->where('nim_nis', $sesi_nim)->orderBy('id', 'desc')->paginate($jumlahBaris, 'absensi');