app/Filters/AuthFilterUser.php

    public function before(RequestInterface $request, $arguments = null) {

        // Do something here
        $session = session();
        helper("global_fungsi_helper");

        $user = new MemberModel();
        $sesi_id = $session->get('member_id');
        $userRole = $user->where('member_id', $sesi_id)->first();
---
SELECT *
FROM `member`
WHERE `member_id` = '2'
 LIMIT 1