app/Filters/NoAuthFilter.php

SELECT *
FROM `member`
WHERE `member_id` IS NULL
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null) {
        // Do something here
        $session = session();
        helper('global_fungsi_helper');
        $user = new MemberModel();
        $sesi_id = $session->get("member_id");
        $userRole = $user->where('member_id', $sesi_id)->first();