app/Controllers/Print/Pdf.php

SELECT *
FROM `member`
WHERE `jenis_user` = 'Student'
ORDER BY `nama_lengkap` ASC
SELECT DISTINCT `nim_nis`, `jenis_user`
FROM `absensi`
WHERE DATE_FORMAT(waktu_absen,'%Y-%m') = '2024-09'
---
        function formatedDate()
        {
            $currentDate = new DateTime();

            $formattedDate = $currentDate->format('j F Y');

            return $formattedDate;
        }

        $absensi = new Absensi();
        $user = new MemberModel();
        $dataUser = $user->where('jenis_user', 'Student')->orderBy('nama_lengkap', 'asc')->findAll();
        $absensiInfo = $absensi->where("DATE_FORMAT(waktu_absen,'%Y-%m')", date('Y-m'))->select('nim_nis, jenis_user')->distinct('nim_nis')->get()->getResult();