app/Models/Absensi.php

SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `nim_nis` = '141141'
AND `status` = 'Masuk'
AND DATE_FORMAT(waktu_absen, "%Y-%m") = '2024-09'
---
    public function getTotalAbsensiByStatus($nimUser, $status)
    {
        return $this->where('nim_nis', $nimUser)
            ->where('status', $status)
            ->where('DATE_FORMAT(waktu_absen, "%Y-%m")', date('Y-m'))
            ->countAllResults();