app/Models/MemberModel.php

    public function getUser($jenis_user)
    {
        return $this->where('jenis_user', $jenis_user)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `jenis_user` = 'Siswa'

    public function getJumlahInstansi($jenis_instansi)
    {
        return $this->where('instansi_pendidikan', $jenis_instansi)->select('nama_instansi')->distinct()->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `nama_instansi`
FROM `member`
WHERE `instansi_pendidikan` = 'sekolah'
) CI_count_all_results

    public function getSuperAdmin($role)
    {
        return $this->where('level', $role)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `member`
WHERE `level` = 'Super Admin'